### 시리즈, 데이터프레임
- 시리즈 : 1차원 배열과 같은 자료구조, 다양한 자료를 저장할 수 있음, index를 가지고 있음.

In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [5]:
import numpy as np
import matplotlib.pyplot as plt

In [6]:
obj=Series([3,1,-5,2])
obj

0    3
1    1
2   -5
3    2
dtype: int64

In [7]:
# 만약 from pandas import Series, DataFrame를 하지 않앗다면
# obj=pd.Series([3,1,-5,2])
# obj

In [8]:
obj.values

array([ 3,  1, -5,  2], dtype=int64)

In [10]:
obj.index
# 인덱스는 저장된 데이터의 이름(번호)
# 인덱스는 행/열 인덱스가 있음
# 인덱스를 이용하여 자료를 참조할 수 있음(loc,iloc,ax)
# 인덱스는 0번부터 부여

RangeIndex(start=0, stop=4, step=1)

In [11]:
obj=Series([3,1,-5,2], index=['d','a','b','c'])
obj

d    3
a    1
b   -5
c    2
dtype: int64

In [14]:
obj['b']
obj['c']=9
obj

d    3
a    1
b   -5
c    9
dtype: int64

In [17]:
# obj['c','a'] # ERROR 
# 2개 이상의 행/열 인덱스 지정시 [[]]사용
obj[['c','a']]

c    9
a    1
dtype: int64

In [18]:
obj

d    3
a    1
b   -5
c    9
dtype: int64

In [19]:
obj>0

d     True
a     True
b    False
c     True
dtype: bool

In [20]:
obj[obj>0]

d    3
a    1
c    9
dtype: int64

In [21]:
obj*2

d     6
a     2
b   -10
c    18
dtype: int64

In [22]:
np.exp(obj)

d      20.085537
a       2.718282
b       0.006738
c    8103.083928
dtype: float64

In [23]:
'k' in obj

False

In [24]:
'a' in obj

True

In [25]:
sdata={'Seoul':1000,'Incheon':200, 'Gwangju':100,'Busan':300}
sdata

{'Seoul': 1000, 'Incheon': 200, 'Gwangju': 100, 'Busan': 300}

In [27]:
obj2=pd.Series(sdata) # key-> index, Value-> Value
obj2

Seoul      1000
Incheon     200
Gwangju     100
Busan       300
dtype: int64

In [28]:
obj2['Gwangju']

100

In [29]:
cities=['Seoul','Incheon','Suwon','Daejon']

In [31]:
obj4=pd.Series(sdata,index=cities)
obj4

Seoul      1000.0
Incheon     200.0
Suwon         NaN
Daejon        NaN
dtype: float64

In [32]:
pd.isnull(obj4)

Seoul      False
Incheon    False
Suwon       True
Daejon      True
dtype: bool

In [33]:
pd.notnull(obj4)

Seoul       True
Incheon     True
Suwon      False
Daejon     False
dtype: bool

In [34]:
obj4.isnull()

Seoul      False
Incheon    False
Suwon       True
Daejon      True
dtype: bool

In [35]:
for k,v in obj2.items():
    print(k,v)

Seoul 1000
Incheon 200
Gwangju 100
Busan 300

In [36]:
#데이터 추가터 추가
obj2['Jeju']=50
obj2

Seoul      1000
Incheon     200
Gwangju     100
Busan       300
Jeju         50
dtype: int64

In [37]:
del obj2['Incheon']

In [38]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
idx = ["서울", "부산", "인천", "대구"]

In [39]:
pd.Series(data) # key가 인덱스 , value는 안에 값들

2015             [9904312, 3448737, 2890451, 2466052]
2010             [9631482, 3393191, 2632035, 2431774]
2005             [9762546, 3512547, 2517680, 2456016]
2000             [9853972, 3655437, 2466338, 2473990]
지역                               [수도권, 경상권, 수도권, 경상권]
2010-2015 증가율        [0.0283, 0.0163, 0.0982, 0.0141]
dtype: object

In [40]:
pd.DataFrame(data) #시리즈와의 차이: 행 인덱스를..?

      2015     2010     2005     2000   지역  2010-2015 증가율
0  9904312  9631482  9762546  9853972  수도권         0.0283
1  3448737  3393191  3512547  3655437  경상권         0.0163
2  2890451  2632035  2517680  2466338  수도권         0.0982
3  2466052  2431774  2456016  2473990  경상권         0.0141

### 데이터프레임 만드는 방법:
1)열이 되는 1차원 데이터 배열 또는 리스트 작성

2)열에 대한 이름을 키로 갖는 딕셔너리를 작성 (딕셔너리 키 부분이 df의 열 이름)

3) 열방향 인덱스: columns, 행방향 인덱스: index

(행렬: 타입 동일함, df:타입 달라도됨)

In [41]:
df =pd.DataFrame(data,index=idx)
df

       2015     2010     2005     2000   지역  2010-2015 증가율
서울  9904312  9631482  9762546  9853972  수도권         0.0283
부산  3448737  3393191  3512547  3655437  경상권         0.0163
인천  2890451  2632035  2517680  2466338  수도권         0.0982
대구  2466052  2431774  2456016  2473990  경상권         0.0141

In [42]:
#키에 해당하는 값이 열에 오기때문에 columns= 할 필요는 없음
pd.DataFrame(data,index=idx,columns=columns)

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [43]:
df.values

array([[9904312, 9631482, 9762546, 9853972, '수도권', 0.0283],
       [3448737, 3393191, 3512547, 3655437, '경상권', 0.0163],
       [2890451, 2632035, 2517680, 2466338, '수도권', 0.0982],
       [2466052, 2431774, 2456016, 2473990, '경상권', 0.0141]], dtype=object)

In [44]:
df.columns

Index(['2015', '2010', '2005', '2000', '지역', '2010-2015 증가율'], dtype='object')

In [45]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [46]:
df.index.name='도시'
df.columns.name='특징'
df

특징     2015     2010     2005     2000   지역  2010-2015 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권         0.0283
부산  3448737  3393191  3512547  3655437  경상권         0.0163
인천  2890451  2632035  2517680  2466338  수도권         0.0982
대구  2466052  2431774  2456016  2473990  경상권         0.0141

In [47]:
df['2010-2015 증가율'] # 추출결과: 열벡터/ 행인덱스 같이출력됨/ 행인덱스 같이출력됨

도시
서울    0.0283
부산    0.0163
인천    0.0982
대구    0.0141
Name: 2010-2015 증가율, dtype: float64

In [48]:
df['2010-2015 증가율']=df['2010-2015 증가율']*100
df

특징     2015     2010     2005     2000   지역  2010-2015 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권           2.83
부산  3448737  3393191  3512547  3655437  경상권           1.63
인천  2890451  2632035  2517680  2466338  수도권           9.82
대구  2466052  2431774  2456016  2473990  경상권           1.41

In [53]:
# 2005년 -2010년  증가율 
#'2005-2010 증가율' 칼럼 추가= (2010-2005)/2005 *100

# feature engineering (특성 공학)

df['2005-2010 증가율']= ((df['2010']-df['2005'])/df['2005']*100).round(2)
df

특징     2015     2010     2005     2000   지역  2010-2015 증가율  2005-2010 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권           2.83          -1.34
부산  3448737  3393191  3512547  3655437  경상권           1.63          -3.40
인천  2890451  2632035  2517680  2466338  수도권           9.82           4.54
대구  2466052  2431774  2456016  2473990  경상권           1.41          -0.99

In [54]:
del df['2010-2015 증가율']
df

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권          -1.34
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54
대구  2466052  2431774  2456016  2473990  경상권          -0.99

In [55]:
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [56]:
type(df['지역'])

pandas.core.series.Series

In [58]:
df[['2010','2015']]

특징     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [59]:
type(df[['2010','2015']])

pandas.core.frame.DataFrame

In [60]:
df[['지역']]

특징   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [61]:
type(df[['지역']])

pandas.core.frame.DataFrame

In [62]:
df

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권          -1.34
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54
대구  2466052  2431774  2456016  2473990  경상권          -0.99

In [64]:
np.arange(12).reshape(3,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [66]:
df2=pd.DataFrame(np.arange(12).reshape(3,4)) # 정수 인덱스
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [69]:
df2[2]# 열 인덱스 2번에 해당자료가 시리즈 형태로 출력됨 (행인덱스는 0)

0     2
1     6
2    10
Name: 2, dtype: int32

In [70]:
df2[[2]]

    2
0   2
1   6
2  10

In [71]:
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

In [76]:
# 행 단위로 데이터 추출-> 슬라이싱이 필요[시작인덱스: 끝인덱스-1]
df[:1] # 0번 행 인덱스 추출

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권          -1.34

In [77]:
df[1:2]

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
부산  3448737  3393191  3512547  3655437  경상권           -3.4

In [78]:
df[1:3]

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54

In [84]:
df['서울':]

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권          -1.34
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54
대구  2466052  2431774  2456016  2473990  경상권          -0.99

In [85]:
df['부산':'인천']

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54

In [92]:
df['2000']['인천']

2466338

In [93]:
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

In [94]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [95]:
%%writefile sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample2.csv

In [98]:
pd.read_csv('sample2.csv',names=['c1','c2','c3']) # 열 이름 설정

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [99]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [101]:
# 데이터프레임의 특정열을 행 인덱스로 사용하고자 한다면
pd.read_csv('sample1.csv',index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [102]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [108]:
# 여러 개의 공백문자로 구분하기
pd.read_table("sample3.txt",sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [109]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [111]:
pd.read_csv("sample4.txt",skiprows=[0,1]) 
# 0번 1번행 index에 해당되는 자료를 skip

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [112]:
pd.read_csv("sample4.txt",skiprows=2) # 2줄까지 무시됨

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [124]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2,없음, two
누락, 3.33, three

Overwriting sample5.csv

In [125]:
df=pd.read_csv("sample5.csv",na_values=['누락','없음',])
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [129]:
# 데이터프레임을 csv로 저장
df.to_csv('sample6.csv')

In [130]:
!type sample6.csv

,c1, c2, c3
0,1.0,1.11, one
1,2.0,, two
2,,3.33, three

In [131]:
df.to_csv('sample7.txt', sep="|")

In [133]:
!type sample7.txt

|c1| c2| c3
0|1.0|1.11| one
1|2.0|| two
2||3.33| three

In [138]:
df.to_csv('sample8.csv', na_rep='누락',encoding='euc-kr')

In [139]:
!type sample8.csv

,c1, c2, c3
0,1.0,1.11, one
1,2.0,누락, two
2,누락,3.33, three

In [140]:
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [141]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [142]:
df.index=['a','b','c']

In [143]:
df

    c1    c2      c3
a  1.0  1.11     one
b  2.0   NaN     two
c  NaN  3.33   three

In [144]:
df.to_csv('sample9.csv') # 행인덱스가 저장됨

In [145]:
# 행인덱스 안나왔으면 좋겠다.
df.to_csv('sample9.csv',index=False)

In [146]:
# 행인덱스와 열인덱스 다 없었으면 좋겠다.
df.to_csv('sample9.csv',index=False, header=False)

In [147]:
# COVID 파일
# https://github.com/CSSEGISandData/COVID-19/blob/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv

In [149]:
# 인터넷에 있는 csv파일을 가져오고싶다..? 
df=pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv')
df

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/14/21,3/15/21,3/16/21,3/17/21,3/18/21,3/19/21,3/20/21,3/21/21,3/22/21,3/23/21
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,55985,55985,55995,56016,56044,56069,56093,56103,56153,56177
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,117474,118017,118492,118938,119528,120022,120541,121200,121544,121847
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,115265,115410,115540,115688,115842,115970,116066,116157,116255,116349
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,11266,11289,11319,11360,11393,11431,11481,11517,11545,11591
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,21380,21407,21446,21489,21558,21642,21696,21733,21757,21774
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
269,NaN,Vietnam,14.058324,108.277199,0,2,2,2,2,2,...,2554,2557,2560,2567,2570,2571,2572,2572,2575,2575
270,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,209304,211602,213791,215984,218061,219912,221391,223638,225976,228044
271,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,2836,2908,2969,3037,3126,3217,3278,3418,3516,3612
272,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,84797,84950,85240,85502,85889,86059,86273,86449,86535,86779
273,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,36484,36504,36535,36552,36611,36652,36662,36665,36684,36717

In [150]:
covid=pd.read_csv('https://github.com/CSSEGISandData/COVID-19/raw/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv')
covid

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/14/21,3/15/21,3/16/21,3/17/21,3/18/21,3/19/21,3/20/21,3/21/21,3/22/21,3/23/21
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,55985,55985,55995,56016,56044,56069,56093,56103,56153,56177
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,117474,118017,118492,118938,119528,120022,120541,121200,121544,121847
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,115265,115410,115540,115688,115842,115970,116066,116157,116255,116349
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,11266,11289,11319,11360,11393,11431,11481,11517,11545,11591
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,21380,21407,21446,21489,21558,21642,21696,21733,21757,21774
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
269,NaN,Vietnam,14.058324,108.277199,0,2,2,2,2,2,...,2554,2557,2560,2567,2570,2571,2572,2572,2575,2575
270,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,209304,211602,213791,215984,218061,219912,221391,223638,225976,228044
271,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,2836,2908,2969,3037,3126,3217,3278,3418,3516,3612
272,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,84797,84950,85240,85502,85889,86059,86273,86449,86535,86779
273,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,36484,36504,36535,36552,36611,36652,36662,36665,36684,36717

In [151]:
titanic=pd.read_csv("https://gist.github.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/fa71405126017e6a37bea592440b4bee94bf7b9e/titanic.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [154]:
df=pd.read_csv('pandas_data/gapminder.tsv',sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [156]:
df=pd.read_csv('pandas_data/scientists.csv')
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician